//#include "58.h"
//
//
////int main()
////{
////
////	return 0;
////}
////
////
////int main()
////{
////
////	return 0;
////}
////
////
////int main()
////{
////
////	return 0;
////}
////
////
////int main()
////{
////
////	return 0;
////}
////
////
////int main()
////{
////
////	return 0;
////}
//
//
//int main()
//{
//	//整型存储得是补码
//	//无符号：原码 = 反码 = 补码
//	//有符号：最高位为符号位，正（0），负（1）
//	//有符号正数：可以理解为与无符号相同
//	//有符号负数：需要进行原反补转化
//	//原码：对应数据的绝对值对应的二进制序列 ，特殊：有符号数最高位变为符号位
//	//反码：符号位不变，其他位按位取反（默认是有符号负数）
//	//补码：反码 + 1 （符号位需要参与运算，通常很少影响到符号位）
//	char a = 10;  //00000000 00000000 00000000 00001010  ——>0x0A
//	char b = 20;  //00000000 00000000 00000000 00010100  ——>0x14
//	char c = -10; //10000000 00000000 00000000 00001010
//				  //11111111 11111111 11111111 11110101
//				  //11111111 11111111 11111111 11110110  ——>0xF6
//
//	//unsigned char d = -10;
//	//unsigned char e = 10;
//	//printf("%u  %u", d, e);
//
//	//char f = 255;
//	//printf("%d\n", f);
//	int a1 = -10;
//	int b1 = a1;
//	unsigned c1 = b1;
//	printf("%d %d %d", a1, b1, c1);
//	return 0;
//}
//
